{"Xm2A4Xyd-dw4x86qZCV3hw": ["Sooo... funny story about Chartreuse before I start this review. Obviously, you see it is five stars... I promise you, it is very well deserved, and if you...", "Can't believe I haven't reviewed Chartreuse sooner! This is most definitely one of my favorite restaurants. I have been here three times and each experience...", "My partner and I came here for the first time on Valentine's day and loved it. Everything we ate was delicious. \n\nWe got four dishes: \n1. steak tartare:..."], "66OeH9RD62D3bXbqefjYvw": ["I find Giovanni's... guilty.  Guilty of having THE BEST Italian cuisine outside of \"Bel Paese\". Sinatra was a fan. The mysterious Order of the Snowman is...", "Probably like 4.5/5, but they get a 4 from me this visit. This was my first time here, my boyfriend took me here for our Valentine's Day dinner although we...", "This was my first time here and I'm definitely looking forward to coming back again.\n\nI wish I remembered the waitresses name as the service was phenomenal...."], "4p1bXdMdETmyU5qhzFxNxw": ["Amazing!! My four besties and I went here to share plates of food and cocktails; all dishes were flavor packed and perfectly seasoned. Drinks were...", "First, this is my favorite restaurant in the D, but last night was disappointing. Our waitress Margot, while very nice and pleasant, was either very busy...", "Selden has remained consistent since it opened, an excellent place to a have a uniquely prepared dinner with food procured from local farmers and an..."], "HYrqw4xlLCNDptBHGrTIbQ": ["Was looking for a new experience. Was looking on yelp for some help. I kept coming back to the reviews on Dime Store. Reading the story of the restaurant...", "Really solid Detroit breakfast joint. They're waffles are light, fluffy and absolutely killer. Their fries have peel still which is lovely. The staff is...", "The Dime Store was great! They have a great variety of breakfast/brunch and lunch options. I supposed I would describe this place as a high end, yet casual,..."], "8ctLeteWujq_EfH2lRSTAw": ["have been wanting to come for ages, decided to finally while at home visiting around 5:15 on a friday. place wasn't too busy when we arrived, but clearly...", "I stopped by after a trip to Eastern Market with my friends to grab lunch. I had heard raving reviews of this pizzeria from some people, and decided to give...", "This or Russell's street are my two go to spots after a stint of late morning to lunch time farmer's market shopping at eastern market. I know I should get..."], "TUR6H5mBXMDGt3qjv5sekg": ["Late on getting to this review, but had an AMAZING experience here with my team. Not only was the pizza absolutely indulgent and next level, but I really...", "I'm from Chicago and I love pizza! All kinds of pizza. White pizza from Long Island, a slice in NYC, deep dish in Chicago, Round Table, Little Caesar's or...", "What can I say about Buddy's?\n\nIf you don't like there pizza, move to another state, you don't belong in Michigan. \n\nSure the original restaurant looks..."], "7ArIKwojlm_Yca29HnGDfQ": ["HOLY TAPAS! \nLuckily got invited to join some colleagues here for dinner during a work trip. We probably wouldn't have found it otherwise. The atmosphere...", "A birthday celebration was the perfect occasion to visit a restaurant that has long been on my \"to try\" list. We met at a nearby coffee shop before heading...", "This is located on the second floor and the main door to get to the elevator is set back from Woodward.\n\nWhat an utter bummer to find our that they no..."], "UdO_uBm3sIM5DwaE8XIpbg": ["Went to Grey Ghost last month to celebrate my friends birthday and walked in with no expectations, only to walk out the door anticipating my next return....", "Amazing octopus!  \n\nCall ahead, reserve, do what you must in order to acquire a seat if you want to eat here at a certain time.  3 of us walked in at 9 on a...", "Really good food - came here 1st time for a wedding reception.\nDrinks , Food & service where spot on - excellent on every level. \n\nWill be back - for brunch..."], "kLwuEacC69wf8aVAa0BojA": ["Mi Pueblo kicks all the ass. I've been going here for 10+ years now. \n\nA friend of mine introduced me to Arandas taqueria back in the day, and I had my...", "Hubby and I are still digging this place! Each time we've been the service has been good and food delish!! \n\nOn this visit, I got the enchilada dinner and...", "Came here with a large group and we were well accommodated! Loved their mole sauce. Was pleased with their vegetarian and vegan options!\n\nUpdate: went back..."], "YqmsCvd3w0RxEiAcYGj64w": ["A very homey bar/restaurant with some unique sandwiches and a large craft beer selection!\n\nA group of us decided to come in here on a nasty, rainy day. We...", "Shockingly expensive! \nThe food was ok but $16 for a salad is $10 to much. \nThe amount of food you get does not match the price you are charged.", "Soooooo I'm up here at Mudgie's with my wife and normally I'm always giving this place a 5rating but today I have to knock off at least 2 of them boys..."], "x7bzkyPv0pf8mmp4BaexZQ": ["Restaurants are what they are. Walking into McDonalds and expecting Barbuto is foolish. Lafayette is a Coney Island. Expect it to be what it is\n\nMoving from...", "First and foremost we 4 of us went had a total of 8 hot digs 3 fries no drinks only water.  The cost out of my pocket was $45.00.    I kept say that u...", "This is it. This is the real deal. This is the Detroit jam.\n\nI always try to come here when I'm back in Michigan and in downtown Detroit. Service is quick,..."], "rMDncCUM1-1cuqA5gv1puw": ["This may be the best pizza I've ever had. The deep dish had a great crunch and the sauce was delicious! The 313 included a great combination of ingredients...", "We sat at the bar and had drinks and calzones.  I felt like the drinks were not worth the price.  Watered down and overpriced.  $11 for a cheap pour in a...", "I think we really like this place. I say that we \"think\" only because both times we've been here it's been at the waaaaaay tail end of a very long day so..."], "NcM6ASYzFMDN366FsuBTVw": ["Green Dot Stables is a great little dive bar outside of Detroit. Even for someone who doesn't drink, I enjoyed the atmosphere, the unique food menu and the...", "Having lived down the street from this place for two years, I finally made the voyage to dine in. My reluctance had to do with the name, and the fact that...", "Very interesting hipster eatery situated in the middle of a Detroit wasteland. Seems to suffer the Slo's barbecue affect- far more crowded then the food..."], "2sIc82MtKcAjx7oW3b6sqA": ["Our bartender, Trisha, was amazing. Omg. She made the whole experience wonderful. \nLoved our food. Our wine. Plus a nice location, close tot the Marriott....", "The chicken marsala was tender and flavorful. The pasta was perfectly prepared. The cocktails masterful and fairly priced. \nNot only was my server (Ashley...", "I've never really liked Andiamo but decided to give this a try on a group dinner. Everything about this place is great for dining, except the food, which we..."], "unpNAU7aIF11_VQvZXUOWg": ["What a cool bar and restaurant! Located inside the Detroit Foundation Hotel, The Apparatus Room is a swanky and cool spot. I immediately loved the vibe....", "The Apparatus Room is a beautiful restaurant. We were all excited to come and experience this place that's owned by a formerly Chicago-based Michelin...", "Visited The Apparatus Room on a recent trip to Detroit with my sister, and we were really impressed! We had read really great things about this spot for..."], "ZrThFosYNhJmoMx0FI8P3A": ["Enjoyed the food here once we figured out what we wanted to have.  And discovered the best thing on the menu for me, was the sushi...we ate here a couple of...", "I was so I impressed with the view that's all I could look at for a few minutes. Call ahead and get a reservation- it got us a booth with this amazing view....", "I have been to Joe Muer many, many times especially for lunch.  As I joined my cousin here for dinner.  I arrived 15min after they were seated since I had..."], "p_YqaizB_k9q6evn0xeMTw": ["I have been to them all...Ruth's Chris, Morton's, Capital Grill, Shula's....and this is right there with them if not the best. I honestly think their filet...", "Nice location, close to Campus Marcus.\nGreat food and great service. Little pricey but worth it. Beef cheek dumplings, spinach feta,  Brussels sprouts w/...", "My husband and I took our daughter and her best friend here for our daughters birthday and we were not disappointed! Our server, Amy, was so sweet,..."], "WFtnK-JJnoVHtbMAQW7tNg": ["Went to the Hudson Cafe on a Sunday in March around 11am.  Took a good 45 minutes to get seated at a table.  I suggest putting your name on the waiting list...", "Came here during the corona virus outbreak and was immediately approached with such rude attitude from the hostess.  I told her that we had joined the...", "We actually went here a few months ago. The best thing about The Hudson Cafe is being able to use the yelp app to get on the wait list. \n\nThe food is good,..."], "jDHPcMstUfhnbp-4dVm7YQ": ["The first time I came here was with a friend, for lunch...and it was great!  I had the catfish fillets with two sides, collards and yams!  And it was...", "This was my first time visiting this place. It was my mother's birthday and she insisted on a nice dinner downtown. I looked up restaurants on yelp and...", "The food was good, atmosphere was ok, the chairs need to be replaced. Better be using navigation cause you will miss it. \nI was disappointed with the fried..."], "ngu3My-XGzNNL7Bxul5ulQ": ["You have a classy date..your trying to find a classy place..and now you have found one! \n------------------------------------------------\n\nMELTED PECORINO...", "I feel obligated to write this review.  I've been a few times and mostly had good experiences.  But when you give people food poisoning....\n\nOrdered carry...", "Such a chill ambiance!!! Situated not too far from old Tiger Stadium, Ottava Vía is reminiscent of an Italian restaurant in Little Italy, NY just bigger...."], "iqHPET9Z17ugMjorPyDfIw": ["Last night we celebrated my best friends Birthday.  Everyone that we dealt with for the evening just made it that much more special for him \"Paul\".  From...", "We went here for a date night service was good but the  server seemed a bit occupied with other tables. But we did go upstairs to the cigar area which was...", "I love coming to LCH...it is one of those places with an old school flare. After being closed many years it reopened and is one of my favorites. It has..."], "8I1Ja8TbfEN0UOWocP0usA": ["We decided to meet up in Detroit! Just another one of our random adventures together.  I love jazz and I was looking for and I am still looking for a jazz...", "Cliff Bell's is the place to go for jazz and crafted cocktails in downtown Detroit. The history of Cliff's goes back to the 1930s and you can immediately...", "Broooooo there is no establishment on this planet I love more than a good jazz bar - and one with roots, no less. Cliff Bell's is just that, touting old..."], "W8sLqrbS-ZxIuEuQbjAIrw": ["My friend had a list of food spots he wanted to take me. This one was on top of his list. They have good BBQ, sauces and sides. This restaurant is owned by...", "I understand Detroit is finding it's way. .. particularly as it navigates the pros & cons of gentrification, an influx of new corporations and a housing...", "I've been to slows 4 or 5 times over the course of several years. My first few experiences were awesome, which is why I kept coming back. I am sad to report..."], "RvZGz_qp8JWfG27vI-TnBQ": ["Tried this place out before going to a concert at the Masonic Temple. We arrived after 5 on Saturday. It was busy and we had a short wait. The inside of...", "My job carried me across the winds to a building just down the street from Mercury Burger Bar, so I decided to give it another shot. Since my first poor...", "Very good burger restaurant in Corktown. I have found that the quality of the food is extremely high and it's a fun place to hang out in to boot.  \n\nMy only..."], "oeomzExb17rIkur7hNK-HQ": ["A bunch of us went here before a Tigers game and were pleased with our food and service. \n\nThere were 6 of us in the party, and they got us in and out...", "Fun fact about me; \n\nWhen I was 21 I really over did it with mojitos... I used to love them, then grew to HATE them. \n\nWell when bar hopping last week, a...", "Lively place with lovely food! \n\nI've always been a huge lover of Cuban food and I was surprised by food out here being so authentic! \n\nI ordered the..."], "HBX4hBNcOYwAJ2kAWebtbA": ["Wonderful experience from start to finish. \nOur waiter, Todd,  was attentive in a good way. \nNot crazy overbearing, but seemed to be right there when we...", "In the middle of a pandemic there was 0 sanitation. I was told via social media that the buffet was going to be cleaned constantly and hand sanitation...", "This was our first visit to a Texas de Brazil but we have been to other Brazilian steakhouses in the past. My husband loves the all you can eat meat and..."], "65pRcC4awElAnzH4io9Chw": ["Awesome beer, great environment and fun games to play inside!\n\nA group of us stopped in for a flight and some awesome nachos and pretzels. We almost passed...", "Nestled on a quiet street in Corktown, Batch Brewing maintains a low profile in the city. You will probably only hear about it through word of mouth. Not...", "Don't come here if you're hungry. We went around dinner time only to come to find out they ran out of ALL their food menu items, expect pretzels. Probably..."], "XSdPHFMD4npoSKAih2mcqg": ["Two words - chef's tasting!  I was a tiny bit concerned when we made a reservation for the chef's table at Republic on a cold and rainy Detroit night, but...", "Absolutely hands down the best experience I've ever had at a restaurant. From start to finish from service to food, everything was perfection. \n\nWe did the...", "Pleased as punch with this experience. It was recommended to me by a local while I was in town for Detroit Grand Prix and I'm happy I went with this..."], "jsCoUs3A4eAGmQCv-cQMgg": ["This spot has quickly become my new favorite spot in the lansing, mi area. I went here earlier in the year and decided to take my girlfriend back later in...", "Update!!*******\nthey changed the menu....... -2 star ... our last visit... food was decent.... nothing to write in about tho.. everything was just...", "Decided to try brunch at HopCat last weekend and thought it was alright. My boyfriend had the breakfast burrito and I tried the pork sandwich. I thought the..."], "2ryA0axzi8P5zbQAePZ0ow": ["The Whitney... known for being one of Detroit's most haunted establishments. Also, named after the late Whitney Houston who died back in 1900 following a...", "Ok, I want to preface this by saying this is in reference specifically to the \"Ghost Tour\" ONLY. We arrived well in advance for the 10:45 tour with a couple...", "About 6 years from my last review, and 8-9 years from when I first visited the Whitney, so this calls for an updated review!\n\nEvery year, my boyfriend and I..."], "4QDFNHNhgF6gRR9siCKpxw": ["I've had Parks & Rec Diner on my list to check out for awhile, simply because I loved the TV show, and it did not disappoint. While the diner actually has...", "Super cute places tucked away on the outskirts of downtown Detroit. Their menu features classic brunch items with unique twists like their seeet potato...", "I love Parks & Recs! Every time I come here there's something new on the ever evolving menu. They have simple and fresh ingredients that always wow! From..."], "vSL3-uVBMEN72cldQjI_JA": ["X and I celebrated our anniversary with dinner at Iridescence. I had made the reservation a few weeks in advance via OpenTable and we were seated right...", "This is my second time coming here and I definitely was not disappointed. My boyfriend and I had a reservation and were promptly seated upon our arrival....", "I was a little disappointed with Iridesence for the price and hype of other reviews. First things first, we couldn't get a reservation the night we were..."], "q2BSrIE_FQjQGtw6_N5C5Q": ["I absolutely love this place. Truly authentic food and they have my favorite hard-to-find wine from Northern Spain as well-Txakoli. The owner is delightful...", "La Feria is awesome! There are not enough Spanish tapas places out there. They have a cute wine bar attached, per the staff, it's the same owners or same...", "The value for money at this place is great! I love that you can get a wide variety of foods for a reasonable price. Compared to Aventura in Ann Arbor, one..."], "DGKGnFBhBbT2ZG6Tw4MeSQ": ["Had to fly into Detroit for a wedding and we stayed at the Greektown Hotel & Casino. We noticed a small little BBQ joint across the street from the hotel...", "This review is two fold: food and service.\n\nFOOD: I went with my standard pulled pork sammi so I can compare to other BBQ joints. This sammi was delicious;...", "My girlfriend and I hit up this place in Greektown with high expectations after seeing how packed they were the night before, but our experience fell short..."], "fvq6GctVWHECsH3Qr7Cy0w": ["We came here after an afternoon of fun at Campus Martius. We didn't have to wait to get a table, which was good because I was very hungry.\n\nIt took a little...", "First review of 2020:\n\nSo we went here on Sunday and enjoyed a brunch. The brunch ends at 3pm. Grand Trunk Pub has $7 Bloody Marys and Mimosa. (The refill...", "I love grand trunk for so many reasons!\nTip:  read up on your history before yo get here! It will mean so much more to you when you understand where you..."], "le3t2klC9l-Xc3Uym0i6GA": ["Excellent food, and great service! The jalapeño biscuits were absolutely amazing, and the MadeRite encrusted, Dirty Blonde battered, fish and chips was the...", "Nice Atmosphere, I liked the area of town this place was in. Parking on the street but difficult to find. The place has a nice gastropub vibe. The person...", "Decided to continue my progressive dinner down the street. \n\nThis is on the corner of Woodward and John R. It's a narrow bar and restaurant. Lots of bar..."], "lZyf7m2XxI5b3YM0vOLCXw": ["This is one of the best sushi restaurants I've been to in the country. Everything was delicious....", "We never got to try it. Poor planning and execution by the restaurant is at fault. The six of us were supposed to sample three different rolls for the...", "My husband and I love sushi and, since this was a rare vacation, we decided to attempt an early dinner at Maru with our twin 13 month olds and our massive..."], "qoa4G6VPNewFZeZse0e79w": ["Lady of the House fits right in with the historic, turn of the twentieth century feel of Corktown. The moment you enter its doors, it's like walking into an...", "The theme of the night: salt.\n\nWe ordered the raw oysters (both kinds offered, 6 each), Shrimp Butter, Brussels Sprouts (shaved), and the Prime Rib.\n\nThe...", "I was liking the ambience, the place , the food, but then .... the service got very disappointing . \nI had a reservation for their 6 course meal - valentine..."], "gL6l1EqphkyLqER5lgmReg": ["A perfect evening.\nA charming little spot, inside the \"Belt\" alley downtown, with comfortable, cozy ambience. Cocktails were great (bit stiff in cost and...", "Expensive but worth every penny. The beverages are delicious and the bites, though not a huge menu, are excellent. The space is chill but upscale and the...", "TLDR: cool cocktail bar.\n___\n\nI got the cachacha me outside. It's a Caipirinha essentially.\n\nChill. Dimly lit. Fun staff. A lot of folks talking and it..."], "m_jDZuBDEonJLtzB9L6X5g": ["Was encouraged to visit this restaurant with the birthday club coupon, you get a $15 meal \"credit\" if you sign up online.\n\nAs a party of three on a Sunday...", "About a 20 minute wait, not to bad especially because it was just before a show at the Detroit Opera House across the street. \n\nGood service. Our server...", "Nice joint, cool interior, neat view of the brew tanks, minimum wait, nice beer (/selection).\nOur server Floyd was great too. Entertaining, warm and..."], "qa70o0JbMVMQJf4fvWiZaw": ["Noodles were good, server was polite, and atmosphere was fine. I had the lobster ramen and I've  been craving it since. I suppose my only real gripe is it's...", "The Best Ramen in Detroit, hands down\n\nI love their Shoyu and their drinnk menu is bomb. Definite recommend this place to all foodies.\n\nTheir pork belly is...", "This place surely isn't your traditional ramen but its delicious and all the ingredients are fresh. \n\nIt isn't too big of place. Probably seats 40 tops...."], "T6Zl8NssV2qy8Vn9c9ueDQ": ["I had made a food delivery from this spot and absolutely fell in love with the scene. It has a strong hipster feel to it, but it doesn't throw it in your...", "What a fun place! We came here for brunch after many failed attempts...finally we made it in and secured seating in the bar area. To start, they have a huge...", "Discovered this restaurant using Yelp. I found the reviews to be accurate and very helpful. \n\nWe were in town to attend a show at the Motor City Casino and..."], "FyEORWCcFAy3VCeixbU2VQ": ["Came for a birthday Brunch for a friend !\nOur server Richard was AMAZING!!! Highly suggest him for your brunch server his knowledge of the menu and...", "This wasn't a terrible meal but it wasn't a great meal either. Service was great and so was the ambiance. I wanted to like the food more but I didn't. \n\nWe...", "AVOID AVOID AVOID\n\nWe received a $200 gift certificate for Christmas and the manager on duty Michael in the tiniest suspenders I've ever seen refused to..."], "ADi8SOow2XPid6NfR98lGQ": ["Was there 10-19/19 , Dinner with family for my 70th\nBirthday. Everything was great, food , service &\nAtmosphere could not have been better!\nLamb chops &...", "Food was good, my combination platter was cold unfortunately. But the flavor was there. The waiter was very nice, we were a large group and we got taken...", "I was somewhat skeptical after reading some of the yelp reviews. Lots of comments about cleanliness and servers being aloof. WELL, I loved my recent dining..."], "O90Q7WzpAhfuC-QYkCU0Fg": ["I came here twice in one day and my only regret was not finding this place sooner so I could have gone to it even more before leaving town.\n\nThe food is...", "I lean towards giving it a 3.5 stars. Great music, clean dining and I enjoy the artist showcase they display on the wall.\n\nFoodwise it wasn't bad but I was...", "Convinced a friend to come here for lunch today. She is not vegetarian or vegan and the whole ride to the restaurant she kept saying, \"I'll miss having..."], "2-Skd1157bodoslgf-61Vw": ["I would like to send my heartfelt thanks and appreciation to the Rattlesnake's Professional Management Team.  In planning a dear friend's repast luncheon,...", "I My husband and I would always go to the Rattlesnake Club around 2 and meet our friends Ken and Toni for lunch and Marsha and Brandon were wonderful for...", "Thought I was going to have a fabulous experience here, unfortunately, I did not. \n\nMet my sister here for Happy Hour on a Thursday.  It was cold and rainy,..."], "BVtQKhG-A5spAPkveNeKqA": ["There is no cocktail house like this one anywhere else in Michigan.  This is it. And if you appreciate the art of a cocktail, don't miss this place.  You'll...", "Great cocktails from a Roaring Twenties style speak-easy. Bartenders with hipster haircuts and beards wearing shirts and (bow) ties and fancy-ass aprons...", "This place is faaaaancy. Not fancy like suit and tie fancy, but fancy like sophisticated. Their drink menu is insaaaane and they can even make drinks off..."], "NJsDmNXS5c_V5_0pxW0UPg": ["Ah nostalgia! Historically this place stood out for so long with the worlds largest indoor waterfall. Unfortunately it needs repairs and to repair it would...", "Update: My family decided that we should give them another chance.  A year is a lot of time to make changes.  Sadly, the service was still poor.  A person...", "Fishbone's never lets me down! Now it is nothing to rave about, but the food is always pretty good and I always seem to get a great waiter/waitress. This..."], "JbeFCVw4IkXK6pV6HA8O4Q": ["I tried both American Coney! And Lafayette. I prefer this place over Lafayette.\n\nThey take credit card \n\nThis one is open 24/7 and the service was awesome....", "Yays\n*Plenty of seating\n*Plenty of staff\n*Brighter, spacious place\n*More options on the menu\n\nNays\n*The coney dog itself was okay, if doing a direct...", "Super underwhelming experience. First off, felt like the restaurant was dingy, bathroom needed cleaning. My Greek salad was pre-made, and served in a..."], "yg-IIDki1ZixqdSoyJ85jQ": ["Motor City Brewing Works is a must stop anytime I'm in Detroit. Good beer very reasonably priced and fresh made pizza.  Try the Ghettoblaster Mild Ale...", "I love this place. Beer is absolutely delicious, I didn't have any food but everyone who did order, the food looked sooo good. If I lived in the area I...", "Went here with a group on a random Saturday afternoon. Lots of friendly people and we sat outside so you line up at the bar for beers and food. We had about..."], "uoH12KP7sLtTSJf13cyUxg": ["So freaking good! I have a friend who is vegetarian, and we were trying to find somewhere new to go. I'd heard if DVS a lot over the past couple of years...", "I was really let down by this place as I was really excited to try it. After ordering an array of food there wasn't much I really enjoyed from it. The bbq...", "I would love to love Detroit Vegan Soul but it's kind of stuck in time. I like their burger and soul platter, and their German chocolate cake is to die for!..."], "n_QyiAUeW8cVNfVvA3GpdQ": ["I was here once 4 years ago when they first opened but wasn't able to find anything on the menu I could eat that was substantial at the time. Back now and...", "Doesn't look like much when you first come up to the building, but once you walk in its stunning. This place is a very nice upscale wine bar with a good...", "I was pleasantly surprised that I was able to make a reservation when I booked last minute (day off on 12/21). We arrive 30 mins early, knowing we could..."], "dwoSwJ1MkLjCgoy2adC1UQ": ["Ben here twice now and was pleasantly surprised both times. First time my wife just stopped in by chance, had the French onion soup ( my new favorite spot...", "Saddled up to my usual spot, order mushroom gnocchi with extra mushrooms and a side salad. \n\nPlace has been here about 6 years. Was in the transformer...", "This place is so funky. Fixtures are a mix between museum and nuevo funk. So interstellar!! Servers are sweet and real. Really makes you feel..."], "2vPro9dmObwcWcs4gdU_3w": ["Best Italian food in Detroit in my opinion. The back patio is beautiful. I've had several dishes from here and have never been disappointed. \nDon't be...", "This place was a disappointment; it's in sort of a sketchy area, and from the street (which is actually the back side of the restaurant), it looks...", "Don't know how this place has good ratings. Overpriced for the ambience (peeling paint, old decor, scratched up wood panels) and for the mediocre food...."], "70zEOA3dsFEwHs5IIFWiaQ": ["Absolutely gorgeous for brunch! \n\nThey have live music, the decor is comfortable but upscale, and the food is delicious. \n\nThe wait staff is very friendly...", "I can't believe I live only 4 miles away and have never been here. But then again, this place is very easy to miss, with no lighting or signage out front...", "Good experience here. Good service. I was a little surprised when I saw the staff in silk pajamas. Made me feel a little less underdressed. The table cloths..."], "XNU8Im9LGzs7RT6gKdL_kw": ["A Detroit classic!  This is a place that has been around a long time and is still serving up great deli sandwiches and breakfast as well.  I ordered a hot...", "Great CB sandwich and coleslaw. So the place is a bit divey, but the BEST corned beef when I get a hankering!! Rye bread excellent as well as meat, but I'm...", "I LOVE that there are so many regulars that keep this place open. \nI finally made it IN restaurant to order, at first glance, I dont remember the prices..."], "3Nbs9f7DxP3siSu1pjLj1w": ["Thoroughly impressed by Takoi and can't wait to go back! In the dark, the restaurant may look a little intimidating because of the tall gates outside, but...", "The hostess was very sweet. They were busy, but not too busy because we were seated right away. After being seated it took at least 15 minutes for a...", "What a funky place! We went with 4 people and ordered 8 plates to share, which was probably 2-3 plates too many but we wanted to try everything. We started..."], "ngur8BN72eO8vh17hW80dg": ["Stopp'ED in after a concert, at Andrews!! Close E'Nough, Yup! Sweetwater has the Neighborly Vibe. If you frequent Enough. You'll get the NORM Greeting! You...", "I really don't understand why people even mention this place when they're talking about wings in Detroit. The wings here are not very good at all. They're...", "This isn't the classiest place to eat, let's start with that. We were greeted with a women at the door asking for a name, not very nicely but the line was..."], "jUUJPLDNzBmuT4DFX1taaQ": ["BEST FISH FRY EVERRRRR\n\nNicest people! Rachel was wonderful!\n\nHomemade pies were delicious!\n\nLeft with a container of fudge for $4 that's homemade in...", "Went here for the first time to see what the hype was about.  The decor was old and run down.  The fish tasted good but very little meat and mostly thick...", "This place is a gem amongst a Dying Breed.\n\n Any place that still has their bathroom in the kitchen and is still clean enough to be in business is  just..."], "Wp_EGDpkEzNgrnJkgWTBzQ": ["I just came back from Mabel Gray this evening. I truly believe that I ate at the finest culinary establishment the state of Michigan has to offer. From the...", "I can't say anything more about Mabel Gray than what's already been said. It's awesome. The tasting menu is the way to go and if you like alcohol, the...", "My favorite restaurant in Detroit. Its pretty tiny so make sure you make reservations. \n\nThe clarified broth was some of the best broth Ive had. When they..."], "gpOKnMXXiRemJf8x0-oHqg": ["Stopped in for brunch on a morning where every single brunch spot  in Detroit had a 1 hour+ wait. Townhouse is pretty big, so  our wait there was about half...", "This place looks absolutely gorgeous. It's one of the best looking restaurants I've ever been in. If you don't care at all about value and if you're ok with...", "I took an extended weekend trip to Detroit for a bachelor party and brunch at Townhouse was my last meal in the city before heading to the airport. There..."], "YtWT6_MKURJKEpNKbO-nzg": ["This restaurant was so kind and caring during a time of uncertainty for all.  In spite of the challenges of operating an independent business during the...", "Food ordered:\n- Tori Udon $13\n- Spicy Pork Udon $13\n\nThis restaurant was recommended to me as Japanese, after eating here I would describe it more as...", "Really cute Asian-style restaurant in Detroit! We had the dumplings as an appetizer, the spicy pork udon, and the unagi-don. The dumplings were really good..."], "iK0FUjpzLMm0mVVRk0RjZg": ["Hands down the best Mexican restaurant I've been too and it's halal as well! (They have the certificate up front). We got the ribeye steak with beans and...", "We had such a nice dinner here. Their menu is unique and has a lot to choose from. We both got the steak and it was the best steak I've had in a while. The...", "I've been here twice and had two different experiences. The first time my friends and I were allowed to order off the a la carte menu even though it was..."], "15OGyKpAqgAJjlXIQUdpqQ": ["We ate here for a business luncheon after a team building event.  It was a great venue,  amazing service and the food was also very good.\n\nThere are a few...", "This was a quick stop for a drink while bar hopping downtown. This place was was very empty but we livened it up some lol. They have $5 happy hour...", "Pretty cool spot.  I've been wanting to stop in for a while now.  Wood covered older bar with some character.  There is an upstairs dining area. \nCame in..."], "2MxbCp72uNi_ImMErb7uMg": ["This is one of the best breakfast spots in Detroit. Everything from the eggs, to the potatoes, to the muffins, to the bacon, it's all delicious. Would...", "Came here in a group, place looked really good!\n\nMenu is okay, service is eh.\n\nEggs Benedict 8/10 \n\nGroup thought food was okay, no one thought anything was...", "This is my favorite Detroit breakfast place. Local foods, amazing poutine, out of the way, and always nice staff. I recommend going in off peak hours as the..."], "Y-b2ciCZx3B66e3jzwM58w": ["This place was on point! Moe was super sweet and the food was cooked right. Came out quick and was filling. Will definitely come back!", "It is a small spot and dice next to a motel, yes a motel, trying to keep an open mind, it does after all have 4.5 stars.\n\nStarted off with the grilled...", "Delicious breakfast! Unusual looking location, attached to a motel on a major road into the city, you may not think to stop here to eat. But it was..."], "X9Uep5qXDC_GKuX9XvXEbg": ["One of the few restaurants in the Detroit \narea that serves alcohol with breakfast,\nwent there for brunch. Because adjacent\nto a hotel the parking lot can...", "The one plus here is they have their own parking lot. Can't beat that. I decided on this place after trying to find a parking spot in downtown on Fort...", "Can't speak for dinner as I arrived after the kitchen closed. But had a drink at the bar. Bartenders were awesome. Great selection i'm good Kentucky bourbon..."], "DsXh8jluV0BaSkVhxQre8Q": ["SheWolf was fantastic.\n\nI would highly suggest making a reservation in advance, I found that about 2-3 weeks will get you a table for Friday or Saturday...", "SheWolf exceeds all expectations. This place books up fast so definitely make a reservation. The reservation process was smooth and I was contacted...", "This is one of my favorite restaurants in Detroit. I tried the summer menu a few times and loved it. My boyfriend and I returned last night after an..."], "CnCpxcw9r6lgKDk4br8TKA": ["I've eaten here several times and brought many of my friends. Today my friends are all visiting from out of town and they enjoyed the experience. Everyone...", "I'm not the biggest fan of tacos aside from taco bell and home made (dont judge!) But wow is Bakersfield amazing. I usually am not very impressed with tacos...", "ohhhh you enjoy tacos? cool. \nQueso? sweet. \nMarga-freaking-ritas? They have it by the pitcher!\n\nI've gone here twice, and not regretted it twice...."], "KGflsQO1qzh5V5QfwaDekw": ["I was wandering around downtown the other night just enjoying the vibe and snapping photos when I decided that I wanted a bite to eat. Where to go? Well,...", "Came today for brunch around 12:30. It was fairly busy. \n\nMy group of four all ordered mimosas for $12 each with every additional pour for $0.25. That's a...", "If you're looking for a modern, instagramable and trendy place to try in Detroit, this is your place. It's great for brunch dates or a date night out. Came..."], "yYnTE3a0KqE6lvZKFMlWJQ": ["One of the more gorgeous spots I've ever worked from! This cafe/enclosed courtyard located within the Detroit Institute of Arts is free and open to the...", "We had a great experience at the Kresge Court cafe in the DIA. The ambience of the area was gorgeous and it's a special place to have a bite to eat, or a...", "Would I go back again?\nYes... If it's just for drinks :/\nThe atmosphere is absolutely beautiful as if you're in the middle of the streets of a small..."], "8x7oLtLhFjDwDVVhr8Zj5w": ["We were two families on a Sunday afternoon stopped in los Galanes and we had a great time we ordered a variety of entrees ranging from the combo which is...", "Went here with some family members and had a great experience! I'm vegan, and our waitress was super helpful with letting me know what did and didn't have...", "The location is not hard to find. The restaurant is decorated very nicely and has an authentic ambiance. We were seated and within minutes had someone come..."], "VGRn5KgYKMkqdIKtBUzQQA": ["Tried Wahlburger for the first time in Detroit and I wasn't too impressed. But I was willing to give this location a try since it was within walking...", "It's all over my face isn't it? I'm sorry, it's just really hard to smile this wide and eat a sandwich this big without needing to lick my cheeks clean...", "The burgers were incredible. The vibe in the the place ... Meh.\n\nPerfectly cooked burgers that were devoured in an instant. The perfect medium rare. \nI..."], "vwNYA9w988UeqQ7X4m8uLg": ["If you get a chance to stay in the Siren Hotel in Detroit, definitely jump on it. And while you're there, try and pop into the Candy Bar if you can. It's a...", "The Candy Bar is walking into a puff of pink cotton candy of a speakeasy. The tiny bar is located inside of the beautiful redone Siren Hotel. As tiny as it...", "This place is so....much....fun...\n\nThis was the last stop on my second annual friendsgiving and all of my friends really enjoyed it. \nYou cannot make..."], "UB69uSqkwjTKMuGbWEqs5w": ["We were visiting from Atlanta - my godmother suggested this place and I'm grateful she did! \n\nThe food was delicious! \n\nWe had the brows buffalo salad and...", "Blahhh. Overrated. \n\nCould head anywhere else downtown and get as good as a burger.. wahlburgers, five guys, lovers only, shake shack, Brome Modern Eatery,...", "Basement Burger Bar is by far the best burger spot I've been to in the city of Detroit. The service, the location, the food... all 10/10!\n\n I was obsessed..."], "U3wG7XTb07Rf-7n4zjwtBQ": ["Been to many Mexican restaurants in Detroit and none have really lived up to being authentic until Mexican Village.  In the heart of downtown this amazing...", "The atmosphere, food, and service here are all great. We especially love the melted muenster cheese that sits atop several of the classic dishes. \n\nWe...", "Located down in Mexican town; parking is in a lot or on the street. The place doesn't look like much, but food was excellent. I went with the sampler and..."], "Qn3BDpni0V2vtp9P0-85BQ": ["This place had great street tacos! I had the pollo and my husband had chorizo. The beans and rice were great as well! \n\nThey give you chips and salsa when...", "The best Mexican food I've ever had. Period. The chicken has a Portuguese vibe I thought did not exist in Michigan. About a half hour drive I will be making...", "In one word: incredible. I will drive an hour to eat here. I love the tacos, especially the steak and chorizo. People are polite, food is delicious and you..."], "IeYAwACNhY6YbbkfVOuk4g": ["Amazing restaurant! Wish I could give it more stars. \n\nPerfect for brunch! Also great for small and large parties. Everything on the menu seemed tasty....", "Let me start out by saying this three star review is for the food and NOT the staff. From the person that took the reservation to our waiter and everyone in...", "Finally crossed the threshold, after passing by on multiple trips to same area. Stopped for brunch pre-DIA visit. Only two of us and are not cocktail..."], "_GL1Lqbg15Gb0anjqcMmJg": ["I'm always looking for a cool spot to hang out, grab a drink and a bite to eat. I've never heard of this area of Detroit, not until they switched over...", "I had a nice whiskey pour and tried a Green Tea shot for the very first time here. The chicken gyro wrap was loaded with chunks of chicken and I also had...", "Great place for an after work beer and bite.  I've been here several times.  The menu is limited but carries a lot of different items from veg to meat..."], "ga6XUaH06FXz3-5kGxRZ4w": ["Our group stopped by Rusted Crow before a 2pm musical at Fox Theatre, and we all enjoyed it! The food, service and ambiance were all excellent. (Should I...", "I came here for a burger, ordered one, but felt like I had two! I relished their tasty meat patty layered amid bacon strips, cheese, hash browns, a sausage...", "I came here on a Sunday for a birthday dinner get together. We had around 17 people in our group. They accommodate us quite nicely.\nThis place is fantastic,..."], "QUPAXavtWd6LKnvsWV6ywQ": ["This place is awesome. \nThe ambiance is great and there's a good selection of food. Definitely a fun place to hang out with others. I do wish there were...", "From pics this place looks huge. In actuality it is so cramped and badly designed that it's hard go enjoy yourself.  Generally there are no community seats...", "I'm glad I finally got to give DSC a try! It's pretty cool to see something like this come to Detroit. It's small - maybe 6-7 food stalls at this point? But..."], "gwp2wEKZXfWGxnLJKO5bgQ": ["This place is highly underrated. I stopped by for pizza next door but the GM found me and brought me here. Wow. So glad I literally bumped into that guy. I...", "Maybe I had my hopes up to high, but this restaurant was a little disappointing for me. We got the combo #1 which was the gyro and the chicken kebab. The...", "love this place stopped over on way back to new haven road trip with family perfect as always even though that forgot my flaming cheese and my gyro meat on..."], "H-Ek50bSn5KCBQ1_tVmQAA": ["It's a little jewel in Westland, with some\nOf the best fried spicy chicken ever. \nThe menu is simple no fuss. Plastic cutlery and paper plates just adds to...", "Great fried chicken, best in the area.  Pricy, but good.  Not as good as the Chicago locations (not as spicy for some reason), not much more to say.  It's...", "The chicken is just like mama made! The staff is friendly and the service is excellent. But, the mac-n-cheese wasn't even eatable!"], "9zI10-FuCxKqd0FAHwUFRA": ["What a beautiful and uniquely designed restaurant!\n\nLove the igloos in the winter time! \n\nI really enjoyed their crab cake and the fries.  And my mother...", "My husband and I had 6pm reservations on a Saturday night. We arrived 10 minutes early and were seated right away. Our table was by the bar so our drinks...", "I ordered a side salad and the roasted chicken breast, that was the only main entree that looked okay, wasn't feeling anything on the menu. I decided to get..."], "Ppu2cGsOvNhAqpM_CLANiA": ["I'm not a huge fan of buffets usually.. too many people too close to my food. I'm no germophobe but meh.. I'm just not into people sneezing and touching...", "I like the buffet, I think the Chef's efforts are noticeable and I give them credit for the variety, presentation, and some items are quite good. \n\nI had a...", "Came to this buffet after losing money at the Casino. The server was great on ensuring our table was cleared out and our water was refilled quickly. The..."], "tIHUAoxlyX-L3JddTNwKvw": ["Came here on October 6th with a party of 9 which were mostly seated before we arrived late. That's important to know because a lot of places won't seat you...", "I have been such a crusty old man over the years that I had decided a few months back that if I had a bad experience, I wasn't going to leave a review, only...", "Some people wonder much bacon should be in a Bloody Mary. I have a better question: how much Bloody Mary should be in your bacon? Vivio's will help you..."], "cVFXGNMHEipnAUCHhR2vVQ": ["It's not top-tier gourmet but has a good salad and soup bar and a very nice selection of various foods made-to-order while you wait with your cafeteria...", "I always remembered my mother saying that the DIA had amazing food, but I never had a desire to dine in while just going for the art. Today however, I...", "Cafe DIA offers a great break from enjoying all the beautiful art the museum has to offer. \n\nWe walked in not knowing what to expect, but were pleasantly..."], "A7qhrIwaUgdwcLD44JY5XA": ["Went there for brunch with some friends and everything was delicious! Got sat immediately and the service was excellent! Our server was very accommodating...", "I have been wanting to try this place since it opened and it did not disappoint. Celebrated an anniversary here and we were greeted by both the hostess and...", "Valet is the only way to park here. Parking is nearly impossible within a half mile from here. Driven by here several times hoping to find a spot. I parked..."], "P9v9Lj_wd_JzhyhBAhIluA": ["Cafe Nini is very  small, but so charming and welcoming.  It was our first time visiting, and we couldn't even find it.  I'm so glad we did find the cafe...", "After a 2 year sabbatical- ended up here again with the exact same two dishes. Both were good again, as was salad. Service was good, as was the bottle of...", "We asked for the 2 for $50 deal. You get a bottle of wine and two delicious meals. We ordered the perch and chicken picatta. Both outstanding. They also..."], "cVqtIOgBM7NPuK0IQGloaQ": ["This has to be my favorite restaurant in Detroit Metro area. Bar none. Excellent. Different. Tasty. Delicious. \n\nThis is a place where you share meals, but...", "I used to love this place but after my 4th or 5th trip there I'm noticing a not so great trend with the food. Aside from the chicken wings (mindblowing) and...", "I so wanted to like this place!  I booked a table for last Saturday a month in advance for my birthday celebration, so I was quite excited when the day..."], "QgIH8x-IwLdANk_n7mcJ8A": ["Amazing food. Great ambiance. The duck fat poutine was amazing! The brussel sprouts were done so well I had to take the rest home! He got the Mac & Cheese...", "Food (when we got it) was good, service bad. Once again I have to complain about poor service at a Detroit restaurant. Despite having reservations for 7 and...", "Started off with a Atwater porter, Java porter, ginger beer, spicy roasted Brussels spouts, Hercules salad, turkey burger with jalapeños, mushrooms and..."], "Uwo_Nx_2WDvGF9SwVMlEAg": ["Good bar with the big screens and good food! \nThe sausage appetizer is our favorite here.\nThey have a great patio area for the warmer season as well that we...", "The waitstaff is great, and the atmosphere is good. This is a great place to go after a concert at St. Andrews.\n\nI  didn't get any food, but I ordered a...", "Does Craig S eat?!  I really wanted to try the 313 burger to compare to Checkers but he just wanted a beer. We only ordered a beer before heading to our..."], "bcpTLnLbpf711AuBxO_mLQ": ["This was my second time experiencing this amazing delight (the first time was on my first date in Detroit with my fiancé last year). Not a fan of the...", "While a celebratory steak was the main draw, last night I left most impressed by the quality of service we received by our servers (Tyler and Rick--ask for...", "Not just a dinner. An experience. The quality of service can not be beaten anywhere. Everything from my water to my steak was impeccable. I would recommend..."], "kSkRJxIPDOVmbBnFldGh0Q": ["I keep going between 3 and 4 stars. If I were to base my review strictly on \"niceness\" of staff, I would give 5 stars.  Service is consistently fairly slow....", "HORRIBLE SERVICE and COLD FOOD\n\nWe had a 5pm reservation for 8 people, the restaurant was fairly busy but not packed. Once we were seated it was 10 minutes...", "We stopped at Granite City during a break for a convention at the RenCen. We've been to the Troy location many times and expected  the same thing. The..."], "vwo792phWL-6KiTEaghO5Q": ["I've been here twice when travelling to Detroit and both times I thoroughly enjoyed it.  The Avocado Chicken Sandwich was absolutely delicious and the Fish...", "Stopped in for dinner and a drink. Nice small bar in Greektown. Seat yourself sign was up. The server came right over with menus and told us the happy hour...", "We stopped in on a whim while walking around downtown looking for a good place to grab a drink and sit outside, happy we did!\n\nI forget the name of the..."], "bj91BZDt44jIE_1DCDrU_Q": ["Pancakes please! Pancakes please! I could eat these all day, they are so good. I have no idea how they make them to be so flavorful, but they do. I don't...", "Ordered the Richard's pancake ($12.50 bare) with blueberries ($3), side salad ($6.50), staff's favorite ($13.50) with chicken sausage ($5) and eggs over...", "Went to Rose's while I was home over the holidays with my mom and my husband.  It is so cute inside and the menu is just my size: about 10 items to choose..."], "y5f0TpePJ-vOxEjzNvQuwA": ["I've never been so ambivalent about a review - and perhaps, my disappointment stems from my lofty expectations. But three and 1/2 stars rating seems just...", "Great first experience the food was bursting with flavors the drinks were very unique and we had an awesome experience with Matthew! He gave great...", "I have been wanting to go this restaurant since I first heard that it had opened, but we could never find the right time. Now that I've been there, I'll..."], "nVlsHOPxFmFnA9wj_DS_UA": ["My cousin put me hip! She brought home a steak and chicken fajita add cheese and it was soooooo good! I literally hopped in my car and headed straight there...", "Been frequenting Xochi's for as long as i can remember. It's been a family tradition after any game since before i was born. I've now been working in the...", "This is our regular go to after a red wings game.\nI don't even know how this tradition even started now that I think of it. Just ended up here after every..."], "R5OtDkJ4wzkJyPXxrzG7cg": ["We were here for an event at Ford Field (MHSAA Wrestling Finals). The restaurant is small in size and there were only 2 people taking orders and serving...", "I'm very surprised about the high-quality ratings on this establishment. The food is ok, but the establishment is filthy. The floor is filthy, the seats are...", "This is not enough corn beef for me\nWorst corn bees sandwich ever dry and tasteless too"], "RMNdJkdMe7jGMQC0ckBlrg": ["Incredible food and service. The restaurant has a nice ambiance as well. I ate here Friday evening and they had live music. The singer was so good and she...", "Long review worth the read\n\nMy wife and I have eaten here twice now. The first time was obviously a good experience and made us decide to go back again....", "Prism is one of my favorite stops to eat!  I live their salads, apps!  Staff is outstanding!  The shrimp app is to die for!  I live their beet salad in the..."], "PWkqo_whZ0qhLTpLsi5xjw": ["AMAZING! The best pizza in metro Detroit! Absolutely delicious! The service, food and drinks were great!!\n\nAppetizer: we had Truffles Bumblebee and Mootz...", "I have been thinking about trying this place for awhile. Was in the area and decided to order online. \n\nOrder was coming out as I was walking in. Sat in car...", "Came here right when they opened at 11am for a business lunch at noon -party of 8. The hostess was very accommodating, as was another woman who was very..."], "rcBtRcIk35yZumAOymqcFg": ["Gather is a super lowkey spot near Eastern Market. The menu is pretty limited but not limited in deliciousness! \n\nI went for a classic 2x2x2 ( 2 eggs // 2...", "On breakfast: cute spot across from the Easter Market. Super low key, diner-like and hipster vibe in the morning which is a nice alternative to my usual...", "Went here for the first time and loved it. We had a group of 6 and shared the charcuterie board (I expected it to have some cheeses but it was just meats..."], "oiAg2xABaFCKiZTyBMKIvg": ["Z's Villa is a great place to eat before an event downtown. We went before a play at the Fisher Theater. Since two of the people we were with had parked at...", "Huge salad portions!!!! Got a antipasto salad and a side portion of fries and couldn't finish either.\nFairly small location but nice group seating upstairs....", "Really dirty and dark place. I think they purposely dim the lights so you can't see how disturbing your food looks. Don't go in the restrooms unless you..."], "erh3vY9R44hX7NrUzNTjbQ": ["Someone would think this place was the type that has a strict dress code, the design and decor is still popping. I've been here a dozen times, it's actually...", "Decor was beautiful and upscale. Tables were given a more private feel with makeshift walls. No dress code was really enforced.\n\nHost service was extremely...", "I came here on Saturday night. The casino was packed and I couldn't make an Opentable reservation. My husband called and they said come right in. We got..."], "y6fqk-OHUuPw4QjHu-bDow": ["Traffic Jam is such a local staple in the neighborhood. Coming here feels very nostalgic for me no matter how often I visit, especially because I first...", "Returning to this neighborhood decades after my grad school days was a treat. It is cool to see all the new places, but I was warmed to see a familiar place...", "I love old places in Detroit that feel like they have been here through all the renovations and long before. \nTJ&S certainly has (1968) and by the looks of..."], "AejD88NtGNyy4C1cS_vg2A": ["My first visit to this 4th generation, family-owned business now in its 101st year. Abby was working the bar and Tom was working some (inventory?) books....", "7 of us came here on my first visit to Detroit in years. Had never heard of it but my sister said it was good and had a hockey atmosphere, so we said...", "Great! Location. 1/2 a short business block\nfrom Park Place parking - $ 4:00 for none\nresidents, just a 4 min. stroll to River Walk,\nand 8 min.to the..."], "0BcmouUOqQrQn_frFtjLcg": ["This was our first time to come and we loved it!   Our family takes Mexican food seriously and this place was no joke!   We came for lunch and the prices...", "A pretty small spot in a restaurant packed with great food options - I was dubious when my friend brought me here with promises of an amazing lunch special...", "Evie's is the definition of a hidden gem. Not only is it the most affordable restaurant in Southwest Detroit, it's the best. The chicken milanese is my..."], "LipkbMbvM2znf3wYNcEjDA": ["Best Hamburgers in Metro-Detroit. \n\nI've been going to bates for as long as I could remember. I love how small they are, but let's be real that doesn't stop...", "This is what Michigan is known for in terms of food (aside from the pasty):  burgers so greasy you can see through the bag.  It's a great treat.  We grabbed...", "Heaven. This is where I go to experience heaven while I'm still alive. \n\nHoping Bates has a 2nd restaurant just inside the pearly gates (and that make it..."], "28C2ONtU_VpmMA-uQUHhkw": ["The breakfast ordered as room service while staying at the Double Tree in Deaborn while traveling was simply splendid.  The only think was that no syrup was...", "Attached to the Doubletree, this place is geared towards business travelers and hotel guests.  I really enjoyed the breakfast I ate here, it was better than...", "This restaurant is located in the Doubletree Dearborn. Enjoyed drinks at the bar several times but the continental breakfast left little to be desired.\n\nIt..."], "fJ-g62WpfeNbR4qv7qAawA": ["I'm a lifelong Detroit residence and I bought slices from Nikis in the 80s and they were good then and still now . I'm a habitual Half off Large Wednesday...", "We've been coming here for years. I grew up in downtown Detroit. I am also a server of 15 plus years. I know I can't expect to find myself at every...", "They are TERRIBLE about answering the phone. They NEVER pick up. The phone just rings and rings, (or I get a busy signal) and nobody grabs it. I've gone..."], "1ie3hpOjfyw3M0hANBR5bA": ["My brother selected this location for his birthday dinner this year. I had heard great things so I was\nvery much looking forward to dining here. We were...", "The food was amazing and delicious and the staff was very friendly especially the waitress who handled our food and drinks Shia.  She was very lovely and...", "Just okay, and kind of disappointing since it was a pricey meal, even with the restaurant week deal.\n\nI dined here tonight with 7 other Yelper friends. I..."], "CczeReC8hCs-0l1_8sIVgw": ["The food was great and the service was superb! For your money you really do get a lot of food. I ordered a chicken salad and it could definitely feed two...", "This place is a must stop in Detroit at any time of day/ night/ hour/ minute/ second - ANYTIME!\n\nThe menu is absolutely huge and everything just looks great...", "Really nice breakfast. 3 eggs, hash browns, 4 sausage links, toast, all for $7. hit the spot so nice. The eggs Benedict even came with 3 poached eggs, ham,..."], "rjLf7nlwmw10w3--wxR2tw": ["For an extra special Valentine's date, I headed somewhere historic with the beau to celebrate the day. Rather than face the chaos of going the night of St...", "Our group of friends have a tradition of going to a steak house for our birthday dinners. For this particular  birthday we thought we would try a restaurant...", "Was here for drinks and apps with a small event to celebrate a work accomplishment. Friendly staff and  coat check. We had great drinks off the happy hour..."], "pf325w600O3YXpcgznnmRQ": ["Sinbad's is known as a Detroit Classic, right on the water. I've passed it many times while boating on the river, but I had never eaten here before. Well,...", "Decided to stop in to enjoy and evening with family. Upon arriving there is parking so no street parking available.  When we came in we were immediately...", "This is one of those iconic restaurants in Detroit. Don't go there looking for farm to table, locally sourced, fusion fancy food. I don't think the menu has..."]}